{
	"events": [
		{
			"event_id": "dialogic_024",
			"set_theme": "theme-1647134832.cfg"
		},
		{
			"character": "character-1647027241.json",
			"event_id": "dialogic_001",
			"portrait": "",
			"text": "Olá [playername]! Eu sou o Elon Musgo e vou te ensinar um pouco dos conceitos teóricos da ENGENHARIA DA COMPUTAÇÃO. \n Após nossa conversa, você passará por um QUIZ para testar seu conhecimento e, caso atinga a nota mínima, poderá ser contratado no prédio da TESLA.\n [playername], a engenharia da computação é conhecida por abordar tanto software quanto hardware, busca relacionar a programação com a elétrica. Um profissional desse curso é capaz de criar programas de computadores e aplicativos para os mais diversos fins, além disso, faz a integração de placas e circuitos eletrônicos.\n Uma das principais funções cobradas por um engenheiro de computação é a automação de processos e robótica, sendo necessário que ele desenvolva robôs e sistemas digitais para fábricas e indústrias.\n Outro tema tratado no curso é a idéia de cidades inteligentes, que consiste em espaços urbanos que alinha o avanço da tecnologia com questões sociais, como por exemplo, uma plataforma que mostra informações sobre eventos locais, notícias da vizinhança, entre outros. \nAlém disso, utilizam diiversas tecnologias para coletar dados e estatísticas da população para entender e ter um melhor controle de operações e recursos.\n Um outro tema visto no curso de engenharia da computação, são os sistemas embarcados, os quais são embutidos e completamente dedicados ao sistema que ele controla, como por exemplo: calculadoras, urnas eletrônicas, entre outros. Esses sistemas embarcados, são necessários para desenvolver o software juntamente do hardware.\n Sendo assim, os engenheiros de computação são responsáveis por planejar, verificar a viabilidade, desenvolver e interligar essas tecnologias com o espaço urbano.\n Algumas das áreas que um engenheiro de computação pode ocupar são: Projetista de equipamentos de informática, Desenvolvedor de sistemas e Responável por controle e automação.\n[playername], agora que já expliquei o lado teórico do curso, quando você estiver pronto, fale comigo novamente para iniciar o QUIZ e testar eu conhecimento."
		},
		{
			"emit_signal": "emend0",
			"event_id": "dialogic_040"
		}
	],
	"metadata": {
		"dialogic-version": "1.3",
		"file": "timeline-1647027261.json",
		"name": "ElonMusgo-0"
	}
}
