{
	"events": [
		{
			"event_id": "dialogic_024",
			"set_theme": "theme-1647134832.cfg"
		},
		{
			"character": "character-1647027241.json",
			"event_id": "dialogic_001",
			"portrait": "",
			"text": " Bem vindo à minha casa [playername], me chamo Elon Musgo e te ensinarei um pouco mais dos conceitos teóricos da ENGENHARIA DA COMPUTAÇÃO. \n Após nossa conversa, você passará por um QUIZ para testar seu conhecimento e, caso atinga a nota mínima, poderá ser contratado no prédio da TESLA.\n [playername], a engenharia da computação é conhecida por abordar tanto software quanto hardware, buscando relacionar a programação com a elétrica. Um profissional que cursou EC é capaz de criar programas de computadores e aplicativos para os mais diversos fins, além de poder fazer a integração de placas e circuitos eletrônicos.\n [playername], uma das principais funções cobradas por um Engenheiro de computação é a Automação de processos e robótica, sendo pedido que ele desenvolva robôs e sistemas digitais para fábricas e indústrias.\n Outro tema bastante tratado no curso é a idéia de cidades inteligentes, que consiste em espaços urbanos que consegue alinhar o avanço da tecnologia com questões sociais, como por exemplo, uma plataforma que mostra informações sobre eventos locais, notícias da vizinhança etc, além de usarem diversas tecnologias para coletar dados e estatísticas da população para entender e melhor controlar operações e recursos.\n Mais um tema bastante visto no curso são os sistemas embarcados, os quais são sistemas que são embutidos e completamente dedicados ao sistema que ele controla, como por exemplo, sofware de equipamentos hospitalares, calculadoras, urnas eletrônicas, etc., e que são bastante vistos em Engenharia da computação por ser necessário desenvolver o software juntamente do hardware.\n Nesse caso, os engenheiros de computação são responsáveis por planejar, verificar a viabilidade, desenvolver e interligar essas tecnologias com o espaço urbano.\n Algumas das áreas que um engenheiro de computação pode ocupar são: Projetista de equipamentos de informática, Desenvolvedor de sistemas e responável por controle e automação.\n[playername], agora que já expliquei o lado teórico do curso, quando você estiver pronto, fale comigo novamente para iniciar o QUIZ e testar eu conhecimento."
		},
		{
			"emit_signal": "emend0",
			"event_id": "dialogic_040"
		},
		{
			"definition": "1647366069-648",
			"event_id": "dialogic_014",
			"operation": "=",
			"random_upper_limit": 100,
			"set_random": false,
			"set_value": "11"
		}
	],
	"metadata": {
		"dialogic-version": "1.3",
		"file": "timeline-1647027261.json",
		"name": "ElonMusgo-0"
	}
}
