{
	"events": [
		{
			"event_id": "dialogic_024",
			"set_theme": "theme-1647208252.cfg"
		},
		{
			"character": "character-1647269471.json",
			"event_id": "dialogic_001",
			"portrait": "",
			"text": "Olá, sou Bill Portas,  fundador da Microsoft. Eu tranquei Harvard para ser possível criar minha companhia. Com a criação da Microsoft também veio o sistema operacional Windows e mais tarde a Xbox. O Windows hoje é o maior sistema operacional no mundo portanto sendo o mais usado.\nVou falar sobre engenharia de software e depois realizarei o QUIZ com você.\nO engenheiro de software é um profissional qualificado para a construção de softwares de qualidade para a Sociedade. O software desempenha um papel central em quase todos os aspectos da vida cotidiana, no governo, bancos e finanças, educação, transporte, entretenimento, medicina, agricultura, indústria e direito, entre outros.\nDentro de engenharia de software temos o sistema operacional que é um programa para o computador ou o celular, como o Windows ou o Android. É o software encarregado por fazer a interface entre usuário e hardware, sem código binário ou linguagem de máquina. Exemplos de sistema operacional é unix, MS-DOS, OS/2.\nA arquitetura de software claramente faz parte de engenharia de software. Como softwares estão sendo cada vez mais usados principalmente na área científica, robótica e aplicações Web, surgiu de várias técnicas de modelagem e projeto, bem como de linguagens de programação. A arquitetura de software serve como uma estrutura através da qual se tem o entendimento dos componentes de um sistema e de seus inter-relacionamentos. Em outras palavras, ela define a estrutura do sistema, de modo consistente para implementações, já que está diretamente relacionada aos atributos de qualidade como confiabilidade e desempenho.\nA rastreabilidade de requisitos tem conexão com a concepção de fluxo de entrega contínua, um dos assuntos mais avançados da área. A rastreabilidade de requisitos consiste na identificação de relações entre as fontes dos requisitos, entre os requisitos propriamente ditos, e entre requisitos e os outros produtos (artefatos) da Engenharia de Software. Podem abranger também documentos da organização, padrões a serem seguidos, legislação etc."
		},
		{
			"emit_signal": "bpend0",
			"event_id": "dialogic_040"
		},
		{
			"definition": "1647366069-648",
			"event_id": "dialogic_014",
			"operation": "=",
			"random_upper_limit": 100,
			"set_random": false,
			"set_value": "13"
		}
	],
	"metadata": {
		"dialogic-version": "1.3",
		"file": "timeline-1647269347.json",
		"name": "BillPortas-0"
	}
}
